# Taps
tap "leoafarias/fvm"
tap "jesseduffield/lazydocker"
tap "nikitabobko/tap"
tap "homebrew/bundle"

# CLI tools
brew "aria2"
brew "bat"
brew "btop"
brew "cloudflared"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "direnv"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "grep"
brew "jj"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "macchina"
brew "mas"
brew "mise"
brew "openjdk@17"
brew "scrcpy"
brew "stow"
brew "tldr"
brew "tmux"
brew "uv"
brew "yt-dlp"
brew "zoxide"

# Flutter
brew "leoafarias/fvm/fvm"

# Casks — terminals & editors
cask "ghostty"

# Casks — productivity
cask "aerospace"
cask "flameshot"
cask "maccy"
cask "raycast"

# Casks — dev tools
cask "orbstack"
cask "httpie"
cask "httpie-desktop"
cask "visual-studio-code"
cask "postman"
cask "arduino-ide"
cask "beekeeper-studio"
cask "android-commandlinetools"

# Casks — browsers
cask "arc"
cask "firefox"
cask "google-chrome"

# Casks — communication
cask "discord"
cask "whatsapp"

# Casks — media
cask "iina"

# Casks — utilities
cask "aldente"
cask "bitwarden"
cask "capacities"
cask "cloudflare-warp"
cask "coconutbattery"
cask "keyboardcleantool"
cask "localsend"
cask "obs"
cask "figma@beta"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Mac App Store
mas "Xcode", id: 497799835
mas "Transporter", id: 1450874784
